---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StairsComponentTypeUnsupportedError
source: html/434e6d0d-c6a4-8ddc-d88f-48d68a6c1269.htm
---
# Autodesk.Revit.DB.BuiltInFailures.JoinElementsFailures.StairsComponentTypeUnsupportedError Property

The selected stair type/shape isn't supported for attaching a wall to a stair. To continue, detach the wall from the stairs' components.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsComponentTypeUnsupportedError { get; }
```